{
  "authors": [
    "Fei-Tzin Lee",
    "Chris Kedzie",
    "Nakul Verma",
    "Kathleen McKeown"
  ],
  "date_published": "2021-11-27",
  "raw_tex": "\\section{Types of errors in concept merging}\n\\label{sec:error-analysis}\n\\begin{table*}[t]\n   \\centering\n   \\begin{tabular}{c|p{10cm}}\n   \\toprule Error type & Example sentence fragment pair that produces error\\\\ \\midrule\n   \\multirow{2}{*}{Stopword conflation} & ...a failure for Swedish law \\textbf{and} order... \\\\\n   & Both Norway \\textbf{and} Sweden... \\\\ \\hline\n   \\multirow{2}{*}{Missing synonyms} & ...nuclear \\textbf{bombs}...\\\\\n   & ...nuclear \\textbf{arms}...\\\\ \\hline\n   \\multirow{2}{*}{Name skipping} & Estonian informatics center spokeswoman \\textbf{Katrin pargmae} stated...\\\\\n   & \\textbf{Katrin pargmae} also stated...\\\\ \\hline\n   \\multirow{2}{*}{Concept conflation (surface)} & ...required to inform any person whose \\textbf{assets} are being frozen... \\\\\n   & ...an European Union decision to freeze the \\textbf{assets} of the People's Mujahadeen of Iran.\\\\ \\hline\n   \\multirow{2}{*}{Concept conflation (hidden)} & ...the foreign \\textbf{minister} of India... \\\\\n   & ...the foreign \\textbf{minister} of China...\\\\\\bottomrule\n   \\end{tabular}\n   \\caption{Examples of common error types in concept merging.}\n   \\label{tab:errors}\n\\end{table*}\n\nThe first two types of errors are relatively easy to fix. Stopword conflation occurs whenever there are multiple instances of a stopword present in the document,\n(most frequently ``and\" or the organizational membership concept ``have-org-role-91\", which typically appears in the text as ``of\", e.g. as in ``the foreign minister of India\")\nand can be easily avoided by simply holding out stopword nodes from the concept merge process. Nodes that have synonymous but not identical labels will not be merged even when they refer to the same entity;   such as in the third example in \\autoref{tab:errors}: ``bombs\" and ``arms\" are not considered the same concept by concept merging.\nthis can be approximately solved by using a high word embedding similarity threshold rather than exact concept matching.\n\nThe third error, name skipping, is a product of concept merging's initial name and date collapse step, in which name and date nodes are merged with their parents if they are only children, renaming the parent nodes with the combined concept. Name skipping occurs when a name node is merged into its parent in some instances but not in others, which splits the resulting merge clusters into those that were identified by name and those that were not. In the second example in \\autoref{tab:errors}, the first instance of ``Katrin pargmae\" will not be merged with its name node as it has additional children (the organization role of spokeswoman), but the second instance will. This is an inherent issue of the name collapse step, and can be addressed by replacing it with a more robust method of detecting co-reference.\n\nThe final two types of errors can be viewed as special cases of the same error, namely, merging entities that are different instances of the same entity type, but the method of addressing the error differs between cases. In the first case, a node representing an entity that is directly mentioned in the text is erroneously merged with another of the same type. To address this, we would need to perform text co-reference to determine whether nodes of the same type directly co-refer.\n\nIn the second case, nodes that are not explicitly mentioned in the text but appear in the AMR as implicit attachments to an entity that is explicitly mentioned, and are erroneously merged with other implicit nodes of the same type.\nKMTues - The above sentence has no main verb that I could find. I've edited to make less complex. You may want to work on it to improve fluency more. \nIn the second case, nodes that are not explicitly mentioned in the text, but instead appear in the AMR as attachments to a node that does explicitly appear, are erroneously merged with other implicit nodes of the same concept type. Concept merging cannot distinguish between the hidden person nodes in this case, even though they represent entities that do not co-refer.\n\nIt is this final type of error that the person-focused and combined merge strategies we present are designed to directly address: the descendant subtree of any person-type entity mentioned in the text must be merged only with the subtrees of other person nodes coreferent with that entity. We focus on person concepts specifically as \nwe note that \nthis is a very common case that often induces a large subtree.",
  "title": "An analysis of document graph construction methods for AMR summarization"
}
