{
  "authors": [
    "Fei-Tzin Lee",
    "Chris Kedzie",
    "Nakul Verma",
    "Kathleen McKeown"
  ],
  "date_published": "2021-11-27",
  "raw_tex": "\\section{Annotation interface}\n\\label{app:interface}\nAnnotators are given the full list of summary sentences, followed by up to 10 document sentences for each document-summary pair.\\footnote{Since this is single-document news summarization, the information in the summary typically occurs very early in the document.} For each sentence, they are presented with the sentence text first, followed by the list of entities that occur in that sentence, each represented by a handle and a label. The handle for each entity in a document sentence consists of the index of the node within the document (i.e., the handle of the third node of a sentence is `3' for that sentence). The handle for each entity in a summary sentence consists of the index of the sentence within the summary, and a unique identifier within the sentence (for example, the handle of the fourth node in the second summary sentence would be `2d'). The label provided for the entity is its concept label.\n\nThe main annotation interface is a spreadsheet containing the minimal information for summary and document sentences. An example is provided in \\autoref{fig:spreadsheet}.\n\\begin{figure*}\n   \\centering\n   \\includegraphics[width6in]{img/spreadsheet.png}\n   \\caption{An example of the annotation interface for document-summary alignment.}\n   \\label{fig:spreadsheet}\n\\end{figure*}\n\n\\kmnote{This sounds fishy. How do you know when they will need the visualiztion? Won't that bias them in doing the annotation? Could you instead be more specific about when this is needed? For example, could you have algorithmically decided when to provide the visualization based on the AMR structure? }\n\\fnote{Whoops, I guess that was unclear - I meant that we provide the visualization for all sentences, just in case they need it.}\nFor many entities, the sentence text and concept label alone is sufficient to determine the role the node plays in the sentence; however, in case further disambiguation is necessary, we also provide both the AMR-to-text alignments in an HTML file for each document as well as a labeled visualization of each sentence graph.\nKM appendix fine. \n\\kmnote{Is there an interface? That sounds better than just using a spreadsheet.} \\fnote{the interface was a spreadsheet... we can omit that detail and leave it for the appendix, I suppose...}   \\nvnote{perhaps a screenshot would be helpful?} \\fnote{I was going to include one in the appendix - do you think it would be better here?}\n\nSupplemental visualizations of the AMR graph structure and of the node-to-text alignments for each sentence are provided as separate files. Examples are provided in \\autoref{fig:graph} and \\autoref{fig:alignments}.\n\\begin{figure}[H]\n   \\centering\n   \\includegraphics[width7cm]{img/sentence-2.png}\n   \\caption{An example of the graph visualization.}\n   \\label{fig:graph}\n\\end{figure}\n\\begin{figure*}\n   \\centering\n   \\includegraphics[width6in]{img/alignments.png}\n   \\caption{An example of the HTML node-to-text alignment visualization.}\n   \\label{fig:alignments}\n\\end{figure*}\n\nFor each document node in the main spreadsheet, the annotators are asked to provide the following:\nKM not needed. Sounds informal.\ntwo things: \n(1) the space-separated list of handles for the set of summary nodes that refer to the same specific entity as that document node, if any (for example, ``1b 2f\"), and (2) an additional tag marking the alignment list as ``abstractive\" if the document and summary nodes refer to the same instance of an idea but are different concepts - for example, if a university ``organizes\" a workshop in the document, but ``funds\" it in the summary, those two verbs would be an abstractive match - or if one is an abstraction of the other in another way, e.g. one is an aggregate that includes the other. We do not consider the abstraction tags in this paper, but they would lend themselves to future work on more operations such as aggregation and sentence fusion.",
  "title": "An analysis of document graph construction methods for AMR summarization"
}
