{
  "authors": [
    "Fei-Tzin Lee",
    "Chris Kedzie",
    "Nakul Verma",
    "Kathleen McKeown"
  ],
  "date_published": "2021-11-27",
  "raw_tex": "\\section{Introduction}\nAbstract Meaning Representation (AMR) is a graph-based semantic representation that aims to capture semantics at a higher level of abstraction than plain text   \\citep{banarescu-etal-2013-abstract}. It has been used in a broad variety of applications ranging from information extraction to natural language generation. As originally designed, AMR is intended to represent the meaning of a single sentence, and in tasks such as entailment or paraphrase detection, the context of a single sentence suffices to perform the task.   In tasks requiring longer contexts, however, the sentence-level limitation forces any application of AMR either to consider sentences independently or to link them together in some way. We specifically focus on the use of document-level AMR as an intermediate representation for automatic summarization. In contrast to end-to-end neural approaches to abstractive summarization (e.g., ~\\citet{nallapati-etal-2016-abstractive,see-etal-2017-get,chen-bansal-2018-fast,lewis-etal-2020-bart}), the use of an intermediate semantic representation holds promise for more precisely controlling the selected summary content. \n\n\\input{img/fig_pipeline}\n\nPrevious work on summarization with AMR has used different merging strategies to link nodes across sentence graphs in order to form a coherent document graph \\citep{liu-etal-2015-toward-abstractive,hardy-vlachos-2018-guided,dohare-etal-2018-unsupervised}. However, the effects of the specific choices made about how to merge nodes have not been substantially explored. Thus, in this paper, we collect a dataset of annotations consisting of co-reference alignments between document and summary nodes which can be used to evaluate the specific performance of a merge strategy at each step of the content selection process. We also present a novel, person-focused merge strategy through the use of co-reference across sub-graphs, and demonstrate improvement upon the seminal approach to content selection using AMR introduced by \\citet{liu-etal-2015-toward-abstractive}.\n\nIn summary, our contributions are as follows\\footnote{We provide our annotation guidelines and a sample of our dataset in the supplementary data. We will publicly release the full version of the data and code for the merge strategies and evaluations upon publication.}:\n\\begin{itemize}\n   \\item Adjudicated annotations for node alignment between documents and summaries that can be used to evaluate the efficacy of document sentence merging and node-level content selection (\\autoref{sec:annotations});\n   \\item A merge strategy combining aspects of \\citet{liu-etal-2015-toward-abstractive}'s work with person-focused co-reference across sub-graphs (\\autoref{sec:merging});\n   \\item An evaluation of our proposed merge strategy that \\nvnote{substantially?}\n   demonstrates significantly improved performance on both node merging and content selection (\\autoref{sec:experiments}).\n\\end{itemize}",
  "title": "An analysis of document graph construction methods for AMR summarization"
}
