{
  "authors": [
    "Szymon Snoeck",
    "Noah Bergam",
    "Nakul Verma"
  ],
  "date_published": "2025-08-09",
  "raw_tex": "\n\\todo{\"overwhelming\" \"almost all\" and \"vanishingly small\" used one after another, the reading seems very odd}\n\n\nTo what extent is it possible to visualize high-dimensional datasets in a two- or three-dimensional space? We reframe this question in terms of embedding \\(n\\)-vertex graphs (representing the neighborhood structure of the input points) into metric spaces of low doubling dimension \\(d\\), in such a way that maintains the separation between neighbors and non-neighbors. This seemingly lax embedding requirement is surprisingly difficult to satisfy. Our investigation shows that an overwhelming fraction of graphs require \\(d   \\Omega(\\log n)\\). Even when considering sparse regular graphs, the situation does not improve, as an overwhelming fraction of such graphs requires \\(d \\Omega(\\log n / \\log\\log n)\\). We show that neighborhood preservation of an overwhelming fraction of \\(n\\)-vertex graphs requires \\(d\\Theta(\\log n)\\). Even if one only considers \\(k\\)-regular graphs, \\(d\\Omega(\\log \\frac{n}{k} / \\log\\frac{\\log n}{\\log k})\\) is needed. \nThe landscape changes dramatically when embedding into normed spaces.   \nIn particular, all but a vanishing fraction of graphs demand \\(d\\Theta(n)\\). Finally, we study the implications of these results for visualizing data with intrinsic cluster structure. We find that graphs produced from a planted partition model with $k$ clusters on $n$ points typically require \\(d\\Omega(\\log n)\\), even when the cluster structure is salient. We find that data with salient cluster structure requires \\(d\\Theta(\\log n)\\) dimensions to preserve in settings of practical interest. \\todo{strengthen this further} We show that point clouds sampled from a continuous distribution over $\\mathbb{R}^d$ or $\\epsilon$-nets over $d$-dimensional manifold require \\(\\Theta(d)\\) dimensions to preserve. \nThese results challenge the aspiration that constant-dimensional visualizations can faithfully preserve neighborhood structure.\n\n\nIf one insists on \\((\\alpha > 1)\\)-preserving in Euclidean space–––arguably the most realistic desideratum for data visualization–––the picture is even more grim: most graphs require \\(d \\Theta(n)\\), and if \\(\\alpha\\) is large enough, preservation is potentially impossible. We find that graphs sampled from a planted partition model require \\(d\\Omega(\\log n)\\) unless the clusters are fully-connected \\textit{and} \\(\\alpha \\leq 1 + o(1)\\), in which case \\(d \\Omega(\\log k)\\) where \\(k\\) is the number of clusters. \nOverall, these results challenge the aspiration that constant-dimensional visualizations can faithfully preserve neighborhood structure.\n\n\\textcolor{red}{keeps neighbors within some fixed radius and separates non-neighbors by distance at least \\(\\alpha\\) times that radius, for some parameter \\(\\alpha > 0\\). This seemingly lax embedding requirement, which we call \\(\\alpha\\)-preservation, is surprisingly difficult to satisfy. For any constant \\(\\alpha\\), most graphs require \\(d   \\Omega(\\log n)\\) and even most low-degree regular graphs require \\(d \\Omega(\\log n / \\log\\log n)\\). If one insists on \\((\\alpha > 1)\\)-preserving in Euclidean space–––arguably the most realistic desideratum for data visualization–––the picture is even more grim: most graphs require \\(d \\Theta(n)\\), and if \\(\\alpha\\) is large enough, preservation is potentially impossible. We find that graphs sampled from a planted partition model require \\(d\\Omega(\\log n)\\) unless the clusters are fully-connected \\textit{and} \\(\\alpha \\leq 1 + o(1)\\), in which case \\(d \\Omega(\\log k)\\) where \\(k\\) is the number of clusters. Overall, these results challenge the aspiration that constant-dimensional visualizations can faithfully preserve neighborhood structure.} We uncover a stark difference between \\((\\alpha > 1)\\) and \\((\\alpha \\leq 1)\\)-preservation\n\n\nWe show that neighborhood preservation of an overwhelming fraction of \\(n\\)-vertex graphs requires \\(d\\Theta(\\log n)\\). Even if one only considers \\(k\\)-regular graphs, \\(d\\Omega(\\log \\frac{n}{k} / \\log\\frac{\\log n}{\\log k})\\) is needed. The landscape changes dramatically when embedding into normed spaces,\nwhich are more restrictive yet more desirable to practitioners.   \nIn particular, all but a vanishing fraction of\n$n$-vertex graphs demand \\(d\\Theta(n)\\). Finally, we study the implications of these results for visualizing real-world \ndata with intrinsic cluster structure. We find that graphs sampled from a planted partition model require \\(d\\Omega(\\log n)\\) unless the clusters are fully-connected, in which case \\(d \\Omega(\\log k)\\) where \\(k\\) is the number of clusters. We find that data with salient cluster structure requires \\(d\\Theta(\\log n)\\) dimensions to preserve in settings of practical interest. \\todo{strengthen this further} We show that point clouds sampled from a continuous distribution over $\\mathbb{R}^d$ or $\\epsilon$-nets over $d$-dimensional manifold require \\(\\Theta(d)\\) dimensions to preserve. \nOverall, these results challenge the aspiration that constant-dimensional visualizations can faithfully preserve neighborhood structure.\n\nWe also find that preserving the entire set of \\(n\\)-vertex graphs in a normed space requires \\(d\\Theta(n)\\).   We find that a visualization algorithm embedding \\(n\\)-vertex graphs into a normed space requires \\(d   \\Omega(n)\\).   We find that these neighborhood-preserving embeddings typically require \\(d\\) to scale with the number of data points. \n\\todo{use running example! \\(d(u\\not\\sim v)   2 > 1   d(u\\sim v)\\).}\n\n\\todo{fix the start of the individual graph section}\n\n\\todo{fix families}\n\n\n\nWe find, for instance, that preservation of general graphs requires \\(d\\Omega(n)\\); \\(k\\)-nearest neighbor graphs, meanwhile, require \\(d   \\Omega(k\\log n)\\) We find near-matching upper bounds for both. We also investigate preservation of individual graphs, rather than classes of graphs, and approximate rather than exact preservation of input graphs; in both cases we find that the output dimension still scales with the number of points. These results demonstrate that, in general, any constant-dimension data visualization technique (such as t-SNE, UMAP, etc.) \\emph{must} fail at properly revealing neighborhood or cluster structure that may be present in data.\n\n",
  "title": "Compressibility Barriers to Neighborhood-Preserving Data Visualizations"
}
