{
  "authors": [
    "Iddo Drori",
    "Gaston Longhitano",
    "Mao Mao",
    "Seunghwan Hyun",
    "Yuke Zhang",
    "Sungjun Park",
    "Zachary Meeks",
    "Xin-Yu Zhang",
    "Ben Segev",
    "Howard Yong",
    "Nakul Verma",
    "Avi Shporer",
    "Alon Amit",
    "Madeleine Udell"
  ],
  "date_published": "2025-02-14",
  "raw_tex": "\\section{IMO Combinatorics Agent Prompts}\n\\label{appendix:M}\n\n{\n\\small\n\\begin{tcolorbox}[enhanced, breakable, rounded corners, \n   colbackbrown!5!white, colframebrown!75!black,\n   colbacktitlebrown!85!black, fonttitle\\bfseries, coltitlewhite,\n   titleDecoding Prompt, width\\columnwidth]\n\\small   \nYou are a participant in the International Mathematical Olympiad (IMO). Your task is to write a formal proof for a combinatorics problem. Follow these instructions carefully to prepare and complete your proof.\n\n\\begin{enumerate}\n\\item Study the following documents on Writing Clear Mathematical Proofs and on Understanding Mathematical Proofs: \\\\\n$<$writing clear mathematical proofs: a style guide$>$ \\\\\n\\{\\{WRITING CLEAR PROOFS STYLE GUIDE\\}\\}\\\\\n$<$/writing clear mathematical proofs: a style guide$>$\\\\\n\n$<$understanding mathematical proofs$>$ \\\\\n\\{\\{UNDERSTANDING PROOFS\\}\\} \\\\\n$<$/understanding mathematical proofs$>$ \\\\\n\nFamiliarize yourself with these guidelines and best practices. They will be crucial in structuring your approach and writing your proof.\\\\\n\n\\item Review the following training materials: \\\\\n$<$training books$>$ \\\\\n\\{\\{TRAINING BOOKS\\}\\} \\\\\n$<$/training books$>$ \\\\\n\nStudy these materials thoroughly. They contain valuable techniques and strategies for solving IMO-level problems.\\\\\n\n\\item Read these notes on solving combinatorics problems: \\\\\n$<$combinatorics notes$>$ \\\\\n\\{\\{COMBINATORICS NOTES\\}\\} \\\\\n$<$/combinatorics notes$>$ \\\\\n\nPay close attention to the techniques and approaches outlined in these notes. They will be particularly relevant to the problem you're about to decode.\\\\\n\n\\item Examine the problem definition, answer, and its representation as state and action spaces: \\\\\n$<$problem definition$>$ \\\\\n\\{\\{PROBLEM DEFINITION\\}\\} \\\\\n$<$/problem definition$>$ \\\\\n\n$<$problem answer$>$ \\\\\n\\{\\{PROBLEM ANSWER\\}\\} \\\\\n$<$/problem answer$>$ \\\\\n\n$<$state action spaces$>$ \\\\\n\\{\\{STATE ACTION SPACES REWARDS\\}\\} \\\\\n$<$/state action spaces$>$ \\\\\n\nCarefully analyze the problem, its given answer, and how it's represented in terms of state and action spaces. This will help you understand the problem's structure and potential solution paths.\\\\\n\n\\item Analyze the following videos that solve different cases of the problem: \\\\\n$<$solution videos$>$ \\\\\n\\{\\{SOLUTION VIDEOS\\}\\} \\\\\n$<$/solution videos$>$ \\\\\n\nWatch these videos attentively, taking notes on the different approaches and techniques used to solve various cases of the problem. Pay attention to how the solutions are structured and presented.\\\\\n\n\\item Now, prepare to write your formal proof. Keep in mind the following:\n\\begin{enumerate}\n   \\item Your proof should be correct, complete, and convincing.\n   \\item Use clear, precise mathematical language.\n   \\item Structure your proof logically, with each step following from the previous ones.\n   \\item Include all necessary lemmas or supporting claims.\n   \\item Explain your reasoning clearly, especially for non-trivial steps.\n   \\item Address all cases or scenarios relevant to the problem.\n\\end{enumerate} \n\n\\item Write your formal proof. Begin with a brief outline of your approach, then present your detailed proof. Use clear headings and subheadings to organize your work. Include any necessary diagrams or illustrations.\n\nPresent your final proof within $<$proof$>$ tags. Your proof should demonstrate a deep understanding of the problem, showcase advanced mathematical techniques, and adhere to the high standards expected in the IMO.\n\\end{enumerate}\n\n\\setlength{\\parskip}{1em}\n\\end{tcolorbox}\n\n\\begin{tcolorbox}[enhanced, breakable, rounded corners, \n   colbackbrown!5!white, colframebrown!75!black,\n   colbacktitlebrown!85!black, fonttitle\\bfseries, coltitlewhite,\n   titleEncoding Prompt, width\\columnwidth]\nYou are tasked with creating a Pygame + Gymnasium environment to solve an International Mathematical Olympiad (IMO) combinatorics problem. This environment will be used for educational or research purposes, focusing on reinforcement learning and mathematical problem-solving.\\\\\n\nFirst, carefully read the problem description:\\\\\n$<$problem description$>$\\\\\n\\{\\{PROBLEM\\}\\}\\\\\n$<$/problem description$>$\\\\\n\\\\\nand game representation:\\\\\n$<$game representation$>$\\\\\n\\{\\{GAME REPRESENTATION\\}\\}\\\\\n$<$/game representation$>$\\\\\n\n\\begin{enumerate}\n\n\\item Review the following training material on Pygame, Gymnasium, and reinforcement learning: \\\\\n$<$training tutorials and books$>$ \\\\\n\\{\\{TRAINING TUTORIALS AND BOOKS\\}\\} \\\\\n$<$/training tutorials and books$>$ \\\\\nStudy these materials thoroughly. They contain valuable techniques and strategies for solving IMO-level problems.\\\\\n\n\\item Read these notes on solving combinatorics problems: \\\\\n$<$combinatorics notes$>$ \\\\\n\\{\\{COMBINATORICS NOTES\\}\\} \\\\\n$<$/combinatorics notes$>$ \\\\\nPay close attention to the techniques and approaches outlined in these notes. They will be particularly relevant to the problem you're about to encode.\\\\\n\n\\item Use the following template as a guide for structuring your Gymnasium environment:\n\n$<$gymnasium template$>$ \\\\\n\\{\\{ENCODING TEMPLATE\\}\\} \\\\\n$<$/gymnasium template$>$ \\\\\n\nNow, you will implement a Pygame + Gymnasium environment to solve this problem. In $<$problem analysis$>$ tags, break down the problem and plan your approach:\n\\end{enumerate}\n\n\\begin{enumerate}\n\\item Break down the IMO problem into key components:\n\\begin{itemize}\n\\item Given information\n\\item Constraints\n\\item Goal of the problem\n\\end{itemize}\n\n\\item Brainstorm potential state representations and action spaces:\n\\begin{itemize}\n\\item How can the problem state be represented in code?\n\\item What actions can be taken to progress towards the solution?\n\\end{itemize}\n\n\\item Consider how to visualize the problem state using Pygame:\n\\begin{itemize}\n\\item What elements need to be displayed?\n\\item How can the visualization aid in understanding the problem-solving process?\n\\end{itemize}\n\\end{enumerate}\n\nAfter your analysis, follow these steps to implement the environment:\n\n\\begin{enumerate}\n\\item Set up the Pygame environment:\n\\begin{itemize}\n\\item Import necessary Pygame modules\n\\item Initialize Pygame\n\\item Set up the display window with appropriate dimensions\n\\item Define colors and other constants needed for visualization\n\\end{itemize}\n\n\\item Implement the Gymnasium environment:\n\\begin{itemize}\n\\item Import gymnasium and create a new Environment class that inherits from gymnasium.Env\n\\item Implement the following methods:\n\\begin{itemize}\n\\item \\_\\_init\\_\\_: Initialize the environment state\n\\item reset: Reset the environment to its initial state\n\\item step: Take an action and return the new state, reward, done flag, and info dictionary\n\\item render: Render the current state of the environment using Pygame.\n\\item print: Print out the current state and action as text.\n\\end{itemize}\n\\end{itemize}\n\n\\item Integrate Pygame and Gymnasium:\n\\begin{itemize}\n\\item Use Pygame to visualize the environment state in the render method\n\\item Ensure that the Pygame window updates correctly when the environment changes\n\\end{itemize}\n\n\\item Implement the main game loop:\n\\begin{itemize}\n\\item Create an instance of your environment\n\\item Set up a loop that:\n   - Renders the current state\n   - Waits for user input or agent action\n   - Calls the step method with the chosen action\n   - Checks if the episode is done and resets if necessary\n\\end{itemize}\n\n\\item Implement the reward system and episode termination:\n\\begin{itemize}\n\\item Define the reward function based on the problem description\n\\item Determine the conditions for episode termination\n\\item Update the step method to return appropriate rewards and done flags\n\\end{itemize}\n\n\\item Test and debug the environment:\n\\begin{enumerate}\n   \\item Run the environment with random actions to ensure it functions correctly\n   \\item Verify that the rendering is accurate and informative\n   \\item Check that rewards are calculated correctly and episodes terminate as expected\n\\end{enumerate}\n\n\\end{enumerate}\n\nOnce you have finished planning, implement the complete Pygame + Gymnasium environment. Your implementation should include code that runs the game on small instances.\n\nYour implementation should be well-commented and follow best practices for both Pygame and Gymnasium. Enclose your entire implementation within $<$implementation$>$ tags. \\\\\n\nExample output structures:\n\n$<$implementations$>$\\\\\n\\{\\{IMPLEMENTATIONS\\}\\}\\\\\n$<$/implementations$>$ \\\\\n\nRemember to handle any specific requirements or constraints mentioned in the problem description. Your implementation should accurately represent the IMO problem while providing a functional Pygame + Gymnasium environment for solving it. \\\\\n\nIMPORTANT: Do not forget to model the game in pygame and gymnasium, and ensure that the rendering is accurate and informative.\n\\setlength{\\parskip}{1em}\n\\end{tcolorbox}\n\n\n\n\\begin{tcolorbox}[enhanced, breakable, rounded corners, \n   colbackbrown!5!white, colframebrown!75!black,\n   colbacktitlebrown!85!black, fonttitle\\bfseries, coltitlewhite,\n   titleData for In-Context Learning Prompt, width\\columnwidth]\n\nYou are tasked with identifying and recommending relevant resources that would assist an LLM in solving a given International Mathematical Olympiad (IMO) combinatorics problem using a specific approach. This approach involves encoding the problem into a game environment, using deep reinforcement learning to find an optimal policy, and then decoding the results to formalize a proof.\n\nFirst, carefully read and analyze the following IMO problem:\\\\\n$<$problem description$>$\\\\\n\\{\\{PROBLEM\\}\\}\\\\\n$<$/problem description$>$\n\nYour task is to identify books, tutorials, notes, guides, websites, and other resources that would be beneficial for an LLM to have in its context when approaching this problem using the described method. Follow these steps:\n\n1. Analyze the problem:\n- Identify the key mathematical concepts involved\n- Consider how the problem could be transformed into a game environment\n- Think about what knowledge would be needed for the encoding, deep reinforcement learning, and decoding phases\n\n2. Identify the main areas of knowledge required, which may include:\n- Combinatorics principles relevant to the problem\n- Game theory and state space representation\n- Deep reinforcement learning techniques\n- Python programming, especially using Gymnasium\n- Computer vision and image processing (for video frame extraction and augmentation)\n- Natural language processing (for generating textual representations and explanations)\n- Formal mathematical proof writing\n\n3. For each identified area, list and briefly describe relevant resources. These may include:\n- Textbooks on combinatorics, game theory, reinforcement learning, etc.\n- Online courses or video tutorials\n- Academic papers or survey articles\n- Documentation for relevant Python libraries (e.g., Gymnasium, OpenAI Gym)\n- Websites with explanations of similar IMO problems and their solutions\n- Guides on formal proof writing in mathematics\n\n4. Prioritize resources that are particularly relevant to the specific problem and the described approach.\n\nPresent your findings in the following format:\n\n\\textit{Resources}\n\\begin{quote}\n\\textit{Category Name: [Category Name]}\\\\\n1. \\textit{Resource Name:} [Brief description and relevance to the task]\\\\\n2. \\textit{Resource Name:} [Brief description and relevance to the task]\\\\\n\\ldots\n\\end{quote}\n\\textit{[Repeat for each category of resources]}\n\nEnsure that your recommendations are comprehensive, covering all aspects of the described approach, while also being specific to the given IMO problem.\n\n\\end{tcolorbox}\n}\n\n\n\n\n\n\n\\begin{tcolorbox}[enhanced, breakable, rounded corners, \n   colbackbrown!5!white, colframebrown!75!black,\n   colbacktitlebrown!85!black, fonttitle\\bfseries, coltitlewhite,\n   title Game Representation Prompt]\n\\setlength{\\parskip}{1em}\n\nYou are an AI assistant tasked with generating game representations for IMO combinatorics problems. You will be provided with example pairs of IMO problems and their corresponding game representations, relevant chapters from a reinforcement learning book, and a new IMO combinatorics problem. Your goal is to create a game representation for the new problem, including states, actions, rewards, and start and end states.\n\nFirst, review the following example pairs of IMO combinatorics problems and their game representations:\n\n$<$examples$>$\\\\\n\\{\\{IMO PROBLEM EXAMPLES\\}\\}\\\\\n$<$/examples$>$\n\nNext, familiarize yourself with the relevant reinforcement learning concepts from the following book chapters:\n\n$<$rl chapters$>$\\\\\n\\{\\{RL BOOK CHAPTERS\\}\\}\\\\\n$<$/rl chapters$>$\n\nNow, consider the following new IMO combinatorics problem:\n\n$<$new problem$>$\\\\\n\\{\\{NEW IMO PROBLEM\\}\\}\\\\\n$<$/new problem$>$\n\nTo create a game representation for this problem, follow these steps:\n\n1. Analyze the problem statement carefully, identifying key elements such as objects, constraints, and goals.\n\n2. Define the states: \\\\\n   - Determine what information is necessary to represent the current situation in the problem. \\\\\n   - Consider how the state changes as progress is made towards the solution. \n\n3. Define the actions: \\\\\n   - Identify the possible moves or decisions that can be made at each state. \\\\\n   - Ensure that actions are discrete and well-defined. \n\n4. Define the rewards: \\\\\n   - Determine how to assign rewards or penalties based on the actions taken. \\\\\n   - Consider both immediate rewards and long-term goals.\n\n5. Identify the start state: \\\\\n   - Describe the initial configuration of the problem. \n\n6. Identify the end state(s): \\\\\n   - Determine the conditions that signify the problem has been solved or a terminal state has been reached.   \n\n7. Consider any additional rules or constraints that need to be incorporated into the game representation.\n\nOnce you have completed your analysis, present your game representation in the following format:\n\n$<$game representation$>$\\\\\n\\\\\n$<$states$>$\\\\\nDescribe the state space, including what information is contained in each state\\\\\n$<$/states$>$\n\n$<$actions$>$ \\\\\nList and describe the possible actions that can be taken\\\\\n$<$/actions$>$\n\n$<$rewards$>$ \\\\\nExplain the reward structure, including how rewards are assigned for different actions or state transitions\\\\\n$<$/rewards$>$\n\n$<$start state$>$ \\\\\nDescribe the initial state of the game \\\\\n$<$/start state$>$\n\n$<$end states$>$ \\\\\nDescribe the conditions for reaching an end state\\\\\n$<$/end states$>$\n\n$<$additional rules$>$ \\\\\nIf applicable, describe any additional rules or constraints\\\\\n$<$/additional rules$>$\\\\\n$<$/game representation$>$\n\nEnsure that your game representation accurately captures the essence of the IMO combinatorics problem and can be used as a basis for applying reinforcement learning techniques to solve the problem.\n\\end{tcolorbox}\n\n\\begin{tcolorbox}[enhanced, breakable, rounded corners, \n   colbackbrown!5!white, colframebrown!75!black,\n   colbacktitlebrown!85!black, fonttitle\\bfseries, coltitlewhite,\n   title Auto Formalization English to Lean Prompt]\n\\setlength{\\parskip}{1em}\n\nYou are tasked with translating an IMO combinatorics problem from English to Lean. To help you with this task, you will be provided with example pairs of problems in both English and Lean, followed by a new problem in English that you need to translate.\n\nFirst, carefully study the following example pairs of IMO combinatorics problems in English and their corresponding Lean translations:\n\n$<$example pairs$>$\\\\\n\\{\\{EXAMPLE PAIRS\\}\\}\\\\\n$<$/example pairs$>$\n\nNow, here is the new problem you need to translate from English to Lean:\n\n$<$new problem$>$\\\\\n\\{\\{NEW PROBLEM\\}\\}\\\\\n$<$/new problem$>$\n\nTo translate this problem effectively, follow these steps:\n\n1. Analyze the example pairs: \\\\\n   - Identify common patterns in how mathematical concepts are expressed in Lean. \\\\\n   - Note how variables, functions, and theorems are defined and used. \\\\\n   - Pay attention to the structure of the Lean code, including indentation and syntax. \n\n2. Break down the new problem: \\\\\n   - Identify the key components of the problem, such as given information, conditions, and the question being asked. \\\\\n   - Determine which mathematical concepts and operations are involved. \n\n3. Translate the problem components: \\\\\n   - Start by defining any necessary variables, sets, or functions. \\\\\n   - Express the given conditions using Lean syntax. \\\\\n   - Formulate the main question or theorem to be proved. \n\n4. Structure your Lean code: \\\\\n   - Use appropriate indentation and line breaks for readability. \\\\\n   - Include comments (preceded by --) to explain complex parts of your translation. \n\n5. Review and refine: \\\\\n   - Double-check that your translation accurately represents the original problem. \\\\\n   - Ensure that all mathematical concepts are correctly expressed in Lean.\n\nNow, provide your Lean translation of the new problem. Write your translation inside $<$lean translation$>$ tags. Make sure your translation is as accurate and complete as possible, following the patterns and conventions observed in the example pairs.\n\n\\end{tcolorbox}\n\n\n\n\n\\begin{tcolorbox}[enhanced, breakable, rounded corners, \n   colbackbrown!5!white, colframebrown!75!black,\n   colbacktitlebrown!85!black, fonttitle\\bfseries, coltitlewhite,\n   title   Auto Formalization Lean to English Prompt]\n\\setlength{\\parskip}{1em}\nYou will be translating an IMO combinatorics problem from Lean formal language to English. To help you understand the task, you will first be presented with example pairs of IMO combinatorics problems in both Lean and English. Study these examples carefully to understand the relationship between the Lean representation and its English equivalent.\n\nHere are the example pairs:\n\n$<$example pairs$>$\\\\\n\\{\\{EXAMPLE PAIRS\\}\\}\\\\\n$<$/example pairs$>$\n\nAnalyze these examples, paying attention to:\n1. How mathematical concepts are represented in Lean\n2. How variables and functions are defined\n3. The structure of the problem statement\n4. How constraints and conditions are expressed\n5. The relationship between Lean syntax and English mathematical language\n\nNow, you will be given a new IMO combinatorics problem in Lean. Your task is to translate this problem into clear, concise English that accurately represents the mathematical concepts and relationships expressed in the Lean code.\n\nHere is the Lean problem to translate:\n\n$<$lean problem$>$\\\\\n\\{\\{LEAN PROBLEM\\}\\}\\\\\n$<$/lean problem$>$\n\nTo translate this problem:\n1. Identify the key components of the Lean code (variables, functions, constraints, etc.)\n2. Determine the mathematical concepts represented by these components\n3. Structure your English translation to mirror the logical flow of the Lean code\n4. Use standard mathematical terminology and notation where appropriate\n5. Ensure that all conditions and constraints are accurately represented in your translation\n\nOnce you have completed your translation, present your answer in the following format:\n\n$<$translation$>$ \\\\ \nYour English translation of the IMO combinatorics problem \\\\\n$<$/translation$>$\n\nRemember to make your translation clear and accessible to someone familiar with mathematical notation but not necessarily with Lean syntax. Aim for a balance between precision and readability.\n\n\\end{tcolorbox}\n\n\n\\begin{tcolorbox}[enhanced, breakable, rounded corners, \n   colbackbrown!5!white, colframebrown!75!black,\n   colbacktitlebrown!85!black, fonttitle\\bfseries, coltitlewhite,\n   title Cycle Comparison Prompt Between Original Problem in English and Backtranslated Problem in English]\n\\setlength{\\parskip}{1em}\nYou are tasked with verifying whether a given version of an IMO combinatorics problem is mathematically equivalent to the original problem. Follow these steps carefully:\n\n1. First, read the original IMO combinatorics problem:\n\n$<$original problem$>$ \\\\\n$\\{\\{$ORIGINAL PROBLEM$\\}\\}$ \\\\\n$<$/original problem$>$\n\n2. Now, read the version to be verified:\n\n$<$version$>$ \\\\\n$\\{\\{$VERSION$\\}\\}$ \\\\\n$<$/version$>$\n\n3. Analyze both problems carefully. Pay close attention to the given information, conditions, and the question being asked in each problem.\n\n4. Compare the key elements of both problems: \\\\\n   - What information is given in each problem? \\\\\n   - What are the conditions or constraints in each problem? \\\\\n   - What is the main question or goal in each problem?\n\n5. Use the following scratchpad to organize your thoughts and analysis:\n\n$<$scratchpad$>$\\\\\nOriginal Problem: \\\\\n- Given information: \\\\\n- Conditions: \\\\\n- Question asked:\n\nVersion to Verify: \\\\\n- Given information: \\\\\n- Conditions: \\\\\n- Question asked:\n\nComparison: \\\\\n- Similarities: \\\\\n- Differences: \\\\\n- Mathematical implications of any differences: \\\\\n$<$/scratchpad$>$\n\n6. Based on your analysis, determine whether the version is mathematically equivalent to the original problem. Two problems are considered mathematically equivalent if they have the same solution set and can be solved using the same mathematical principles, even if the wording or specific numbers differ.\n\n7. Provide a clear justification for your conclusion. Explain why the problems are equivalent or why they are not, referencing specific elements from both problems.\n\n8. Present your final answer in the following format:\n\n$<$answer$>$\\\\\nConclusion:\\\\\nState whether the problems are mathematically equivalent or not\n\nJustification:\\\\\nProvide a detailed explanation for your conclusion, referencing specific elements from both problems and your analysis\\\\\n$<$/answer$>$\n\nRemember, your goal is to determine mathematical equivalence, not just superficial similarity. Consider how any differences between the problems might affect their solutions or solution methods.\n\\end{tcolorbox}\n",
  "title": "main"
}
