{
  "authors": [
    "Noah Bergam",
    "Szymon Snoeck",
    "Nakul Verma"
  ],
  "date_published": "2025-10-09",
  "raw_tex": "\nt-distributed stochastic neighbor embedding\n\nTo what extent can we rely on the data visualizations generated by t-distributed stochastic neighbor embedding (t-SNE)? We show that the strength of the cluster structure one may infer from a t-SNE output may be far from representative of the input. \n\nproduces visualizations whose cluster structure roughly matches that of the input\nreflects the salient structure in the input\n\\vspace{-0.06in}\nCentral to the widespread use of t-distributed stochastic neighbor embedding \\mbox{(t-SNE)} is the conviction that it produces visualizations whose structure roughly matches that of the input. To the contrary, we prove that (1) the strength of the input clustering, and (2) the extremity of outlier points, \\emph{cannot} be reliably inferred from the t-SNE output. We demonstrate the prevalence of these failure modes in practice as well.\n\\vspace{-0.06in}\n\nWe study these failure modes both theoretically and experimentally.\n\n\n\n's low-dimensional visualization produced by produced by t-SNE. We study these failure modes in both real and synthetic datasets. \n\n(in practice, often subsumed into the ambient sclu).\n\nurthermore, optimal t-SNE embeddings are incapable of depicting extreme outliers. \n\n\nstronger than what is present in the input. \n\n\n\nBy identifying distinct geometric characteristics of stationary t-SNE outputs\n\nthe strength of cluster structure in the input dataset\n\nshould be taken with a grain of salt. We show that t-SNE outputs can arbitrarily exaggerate the strength of cluster structure in the input dataset. \n\nand that optimal t-SNE embeddings are incapable of depicting extreme outliers. We study these characteristics on real-world and \n\ntl;dr optimal t-SNE outputs are biased towards overemphasizing cluster structure\n\nfind that optimal t-SNE embeddings can be arbitrarily more clustered than their inputs per standard metrics of cluster saliency such as the silhouette score. We also prove that optimal t-SNE embeddings are prone to misrepresent extreme outliers. We present experiments which corroborate these findings in practical settings. \n this trend that t-SNE is prone \n\nare liable to exaggerate cluster structure and misrepresent outlier points as though they neatly belong to such clusters.\n\n and misrepresent outliers \n\n",
  "title": "t-SNE exaggerates clusters, provably"
}
